run/tutorial3/fluidBlock/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273;

boundaryField
{
    fluidInlet
    {
        type            fixedValue;
        value           uniform 288;
    }

    fluidOutlet
    {
        type            inletOutlet;
        inletValue      uniform 273;
        value           uniform 273;
    }

    fluidCoupledWall
    {
        type            radiationRegionCoupling;
        value           uniform 273;

        remoteField     T;
    }

    fluidSide
    {
        type            symmetryPlane;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
