run/tutorial3/fluidBlock/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation      on;

radiationModel P1;

noRadiation
{
}

P1Coeffs
{
}

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    a              a      [ 0 -1  0  0  0  0  0] 0.5;
    e              e      [ 0 -1  0  0  0  0  0] 0.5;
    E              E      [ 1 -1 -3  0  0  0  0] 0.0;
}

scatterModel constantScatter;

constantScatterCoeffs
{
    sigma          sigma  [ 0 -1  0  0  0  0  0] 0.0;
    C              C      [ 0  0  0  0  0  0  0] 0.0;
}

solverFreq 1;

// ************************************************************************* //
